{
  "item.portalhexaddon.portal_staff": "Portal Staff",
  "hexcasting.spell.portalhexaddon:twowayportal": "Summon 2 Way Portal",
  "hexcasting.spell.portalhexaddon:onewayportal": "Summon 1 Way Portal",
  "hexcasting.spell.portalhexaddon:removeportal": "Remove Portal",
  "hexcasting.spell.portalhexaddon:rotateportal": "Rotate Portal",
  "hexcasting.spell.portalhexaddon:moveportalinput": "Move Portal Input",
  "hexcasting.spell.portalhexaddon:moveportaloutput": "Move Portal Output",
  "hexcasting.spell.portalhexaddon:summonscry": "Summon Scry",
  "hexcasting.spell.portalhexaddon:getoutputinfo": "Get Output Info",
  "hexcasting.spell.portalhexaddon:resizeportal": "Resize Portal",
  "hexcasting.spell.portalhexaddon:setportalsides": "Set Sides Portal",

  "portalhexaddon.entry.hexways": "Hex Ways",
  "portalhexaddon.page.hexways.onewayportal": "Accepts a Vector for the portal spawn, one for output, a third for rotation, and a number for the size. This is unfortunately is quite expensive due to the balance of media, costing 32 charged amethyst per size given",
  "portalhexaddon.page.hexways.twowayportal": "Accepts a Vector for a portal side, another one for the other portal side, a third for rotation, and a number for the size. This is much cheaper then 1 Way Portals, costing only 16 charged amethyst per size given",
  "portalhexaddon.page.hexways.summonscry": "Works like a 1 way portal, but I seem to not be able to travel through it. However I dont have to find a scroll for it, much cheaper too, costs about 4 shards",
  "portalhexaddon.page.hexways.moveportalinput": "Takes a portal entity and a location vector, and relocates the side you are looking at to that vector. This is perfect for moving portals I have missed placed. It is free",
  "portalhexaddon.page.hexways.removeportal": "Remove Portal takes a portal entity, and closes the portal pair, perfect for when the portal is slowing down reality, or if I just don't want a portal anymore. Is free",
  "portalhexaddon.page.hexways.portalambit": "With the discovery of Hex Portals, I have discovered Ambit may flow through them, however at a loss. The formula for Ambit flow seems to be \"(32 - My location)/2\". Along with this and the Move Portal spell, this can be greatly powerful",
  "portalhexaddon.page.hexways.setportalsides": "As much as I love the Hexagons, sadly they don't fit every situation. However, I can change the amount of sides of a portal with spell, it seems like it rounds the number I feed it. It is free",
  "portalhexaddon.page.hexways.resizeportal": "I have reasons for not wanting to use normal sizes. By giving a height and a width I may change the size of the portal, it does change it to back to a hexagon though. Costs the shard average between the height and width",
  "portalhexaddon.page.hexways.getoutputinfo": "This nifty little pattern return ether the portal's output portal, or the vector of the portal. This could be useful combined with Portal Ambit. It has not cost as far as I can tell, strange",
  "portalhexaddon.page.hexways.rotateportal": "I have rotated my portals wrong, luckily, I can use this spell to change the rotation of the portal. However it rotates both pairs of portals... Costs nothing, strangely cheap, I should take use of that",
  "portalhexaddon.page.hexways.portalambittitle": "Portal Ambit",
  "portalhexaddon.page.hexways.pageintro": "I have discovered how to make wormholes (or is it electron tunneling?), with media. This discovery was powered by the other modification of \"Immersive Portals\". I should make use this discovery post haste. ",
  "portalhexaddon.page.hexways.pageintrotitle": "Hex Portals?"
}